import { ConfedentialWrapper } from "./styledConfedentialPage";

export const ConfedentialPage = () => {
  return (
    <ConfedentialWrapper>
      <p>
        1.1. Мы не осуществляем сбор ваших персональных данных с использованием
        Сайта.
      </p>
      <p>
        1.2. Все данные, собираемые на Сайте, предоставляются и принимаются в
        обезличенной форме (далее – «Обезличенные данные»).
      </p>
      <p>
        1.3. Обезличенные данные включают следующие сведения, которые не
        позволяют вас идентифицировать:
      </p>
      <p>
        1.3.1. Информацию, которую вы предоставляете о себе самостоятельно с
        использованием онлайн-форм и программных модулей Сайта, включая имя или
        номер телефона и/или адрес электронной почты.
      </p>
      <p>
        1.3.2. Данные, которые передаются в обезличенном виде в автоматическом
        режиме в зависимости от настроек используемого вами программного
        обеспечения.
      </p>
      <p>
        1.4. Администрация вправе устанавливать требования к составу
        Обезличенных данных Пользователя, которые собираются использованием
        Сайта.
      </p>
      <p>
        1.5. Если определенная информация не помечена как обязательная, ее
        предоставление или раскрытие осуществляется Пользователем на свое
        усмотрение и по собственной инициативе.
      </p>
      <p>
        1.6. Администрация не осуществляет проверку достоверности
        предоставляемых данных и наличия у Пользователя необходимого согласия на
        их обработку в соответствии с настоящей Политикой, полагая, что
        Пользователь действует добросовестно, осмотрительно и прилагает все
        необходимые усилия к поддержанию такой информации в актуальном состоянии
        и получению всех необходимых согласий на ее использование.
      </p>
      <p>
        1.7. Вы осознаете и принимаете возможность использования на Сайте
        программного обеспечения третьих лиц, в результате чего такие лица могут
        получать и передавать указанные в п.1.3 данные в обезличенном виде.
      </p>
    </ConfedentialWrapper>
  );
};
